import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","WeaponName","WeaponIcon","PriceType","WeaponPrices","PrefabId","SlotType","GunAttitude","NormalAnims","NormalAnimTimes","NormalAtkTime","NormalBulletCount","NormalFireInterval","BulletCount","Damage","GunLoc","GunScale","ReloadAnimation","ReloadSound","SkillAnims","SkillAnimTimes","SkillAtkTime","SkillCDs","SkillBulletCounts","SkillFireInterval"],["","","","","","","","","","","","","","","","","","","","","","","","",""],[1,"手枪","221099",1,[1,8888],"6B813EDF4B3ADFAEBD7C86A9D6BA535C",16,"14037",["20244"],[0.4],[0.2],[1],[0.01],10,35,new mw.Vector(0,0,0),new mw.Vector(1.5,1.5,1.5),"80588","75374",["20244","20244","20244"],["0.2","0.4","0.6"],[0.2,0.2,0.2],[1,5,10],[1,2,3],[0.01,0.05,0.05]],[2,"泡泡枪","168811",1,[1,8888],"15BDCB2E4E51C0050B9BC3AF33316ECD",16,"14037",["20244"],[0.4],[0.2],[1],[0.01],10,35,new mw.Vector(0,0,0),new mw.Vector(1.5,1.5,1.5),"80588","75374",["20244","20244","20244"],["0.2","0.4","0.6"],[0.2,0.2,0.2],[1,5,10],[1,2,3],[0.01,0.05,0.05]],[3,"散弹喷枪","155702",1,[1,8888],"A963840C405ECBE7EBEC57BD46B26565",16,"14037",["20244"],[0.4],[0.2],[1],[0.01],10,35,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80588","75374",["20244","20244","20244"],["0.2","0.4","0.6"],[0.2,0.2,0.2],[1,5,10],[1,2,3],[0.01,0.05,0.05]],[4,"霰弹枪","226214",1,[1,18888],"4FEDD6C54B0257242B22ECA4BE5099DA",16,"221620",["99959"],[0.5],[0.18],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(2,2,2),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[5,"喷火枪","226213",1,[1,18888],"5AC24144451A25F4D04B3D8400D74B75",16,"221620",["99959"],[0.5],[0.18],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(2,2,2),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[6,"手枪","155696",1,[1,18888],"21361072458C51775137F086B3D59EA5",16,"221620",["99959"],[0.5],[0.18],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[7,"火枪","122726",1,[2,28888],"82B2ADED4C512F42721715BFF158D103",16,"221620",["99959"],[0.5],[0.17],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[8,"激光枪","222534",1,[2,28888],"493A3E1D4A6DFD265D8C1BA51A2010C6",16,"221620",["99959"],[0.5],[0.17],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(2,2,2),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[9,"水枪","122716",1,[2,28888],"FADED6DA480333DCE397E08486F6E12B",16,"221620",["99959"],[0.5],[0.17],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[10,"火箭发射器","226826",1,[2,28888],"251FCDE54066648DD9228DA8593CABFE",16,"221620",["99959"],[0.5],[0.16],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(1.5,1.5,1.5),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[11,"橘黄激光枪","95676",1,[2,28888],"4F1B0735442C84A20C4C229746C0FB74",16,"221620",["99959"],[0.5],[0.16],[1],[0.01],30,25,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[12,"加特林","320984",1,[2,28888],"0B70A2E944C51B1851B5A4AADEAF5D7A",16,"221620",["99959"],[0.4],[0.18],[1],[0.01],100,20,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[13,"激光枪","122720",1,[3,38888],"06AB82414F7B76402C8B96961A2C34A0",16,"221620",["99959"],[0.5],[0.15],[1],[0.01],30,35,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[14,"金枪鱼","138213",1,[3,38888],"E7C6A1FA4BB1FFDE6CAF78B69623C3A5",16,"221620",["99959"],[0.5],[0.15],[1],[0.01],30,35,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"80479","75374",["99959","99959","99959"],["0.2","0.6","1"],[0.2,0.2,0.2],[1,3,5],[1,3,5],[0.01,0.05,0.05]],[15,"弓箭","278406",1,[5,58888],"2580BDD74D69D7F57E93E29E74B387B6",15,"20305",["121952","121955","121987","121989","121990"],[1.2,1.43,2.17,1.8,2.2],[0.2,0.2,0.6,0.5,0.8],[1,1,2,1,1],[0.01,0.01,0.01,0.01,0.01],6,100,new mw.Vector(0,0,0),new mw.Vector(1,1,1),"20228","75374",["121981","121981","121981"],["2.47","2.47","2.47"],[1.05,1.05,1.05],[1,3,5],[1,3,5],[0.01,0.05,0.05]]];
export interface IWeaponPropElement extends IElementBase{
 	/**唯一ID*/
	ID:number
	/**武器名字*/
	WeaponName:string
	/**武器ICON*/
	WeaponIcon:string
	/**价格类型
0-免费
1-金币|Ads
2-Ads*/
	PriceType:number
	/**武器价格*/
	WeaponPrices:Array<number>
	/**武器预制体*/
	PrefabId:string
	/**人形角色插槽类型
LeftHand = 15-左手
RightHand = 16-右手*/
	SlotType:number
	/**持有武器姿态
持有姿态-手枪-14037
持有姿态-步枪-221620
持有姿态-加特林-287706
持有姿态-弓箭-20305*/
	GunAttitude:string
	/**普通攻击动画
手枪攻击动画-20244
步枪攻击动画-99959
加特林技能动画-218510
弓箭攻击动画-121952|121955|121987|121989|121990*/
	NormalAnims:Array<string>
	/**普攻动画时长*/
	NormalAnimTimes:Array<number>
	/**普通攻击时间点*/
	NormalAtkTime:Array<number>
	/**普通攻击子弹数量*/
	NormalBulletCount:Array<number>
	/**子弹发射间隔*/
	NormalFireInterval:Array<number>
	/**子弹数量*/
	BulletCount:number
	/**伤害*/
	Damage:number
	/**枪展示位置*/
	GunLoc:mw.Vector
	/**枪缩放*/
	GunScale:mw.Vector
	/**换弹动画*/
	ReloadAnimation:string
	/**换弹音效*/
	ReloadSound:string
	/**技能动画
手枪技能动画-20244
步枪技能动画-99959
加特林技能动画-218510
弓箭技能动画-121981*/
	SkillAnims:Array<string>
	/**技能动画时长*/
	SkillAnimTimes:Array<string>
	/**技能开火时间点*/
	SkillAtkTime:Array<number>
	/**技能CD*/
	SkillCDs:Array<number>
	/**技能子弹数量*/
	SkillBulletCounts:Array<number>
	/**技能子弹发射间隔*/
	SkillFireInterval:Array<number>
 } 
export class WeaponPropConfig extends ConfigBase<IWeaponPropElement>{
	constructor(){
		super(EXCELDATA);
	}

}